import React from 'react';
import './PrivacyPolicy.css'; // تأكد من وجود ملف CSS لتنسيق الصفحة

const PrivacyPolicy = () => {
  return (
    <div className="privacy-policy-container">
      <h1 className="privacy-policy-title">سياسة الخصوصية</h1>
      <p>
        نُولي في منصة طور نفسك اهتمامًا بالغًا بخصوصية المستخدمين وأمان معلوماتهم التي يشاركونها أو نجمعها نحن، وأي تحديثات أو تعديلات تُجَري عليهما مستقبلًا.
      </p>
      <h2>المعلومات الشخصية</h2>
      <p>
        تلتزم إدارة الموقع، في حدود المسموح لها وفق القانون المنظم، بعدم كشف أي معلومات شخصية عن المشترك، مثل الاسم أو عنوان البريد الإلكتروني وغيرها. كما لن يتم تبادل، أو تداول أي من تلك المعلومات أو بيعها لأي طرف آخر طالما كان ذلك في حدود قدرات إدارة الموقع الممكنة، ولن يُسمح بالوصول إلى المعلومات إلا للأشخاص المؤهلين والمحترفين الذين يشرفون على المنصة.
      </p>
      <h2>التعديل على سياسة الخصوصية</h2>
      <p>
        يحُق لنا التعديل على سياسة الخصوصية والتطوير عليها من وقت إلى آخر مع إشعار المشتركين والزّوار بذلك عبر طرق التواصل المتاحة.
      </p>
      <h2>إخلاء المسؤولية القانونية</h2>
      <p>
        يُقر المستخدم بأنه المسؤول الوحيد عن طبيعة الاستخدام الذي يحدده للمنصة، وتُخلي إدارة المنصة طرفها، إلى أقصى مدى يجيزه القانون، من كامل المسؤولية عن أية خسائر أو أضرار أو نفقات أو مصاريف يتكبدها المستخدم أو يتعرض لها هو أو أي طرف آخر جراء استخدام المنصة، أو العجز عن استخدامها.
      </p>
      <h2>حالات انقطاع الخدمة والسهو والخطأ في المنصة</h2>
      <p>
        تبذل إدارة المنصة قصارى جهدها للحرص والحفاظ على استمرار عمل الموقع الإلكتروني والخدمات المقدمة دون مشاكل. رغم ذلك قد تقع في أي وقت أخطاء وحالات سهو وانقطاع للخدمة وتأخير لها لأسباب عدة خارجة عن سيطرتنا، وفي مثل هذه الحالات سنتوقع من المستخدمين الصبر حتى تعود الخدمة إلى حالتها الطبيعية المستقرة.
      </p>
      <h2>حساب المشترك وكلمة السر وأمن المعلومات</h2>
      <ul>
        <li>يختار المشترك كلمة سر لحسابه، وسيُدخل عنوانًا بريديًا خاصًا به لمراسلته من خلاله. تكون مسؤولية حماية كلمة السر هذه وعدم مشاركتها أو نشرها على المشترك.</li>
        <li>يتحمل الأستاذ المحاضر كامل المسؤولية عن جميع المحتويات الخاصة به، التي يرفعها وينشرها عبر الموقع.</li>
        <li>لا يتم الاحتفاظ بأي من المعلومات التي تُحذف من قبل المستخدمين.</li>
        <li>يلتزم المشترك بشروط الاستخدام، وألا ينشر أي شيء يخالف الشريعة الإسلامية بأي شكل من الأشكال.</li>
        <li>يُمنع انتهاك حقوق الملكية الفكرية أو تشويه سمعة شخص أو مؤسسة أو شركة، أو تعمد نشر أي معلومات تسبب ضررًا لشركة أو شخص أو دولة أو جماعة.</li>
        <li>يُمنع منعًا باتًا استخدام خدمات الموقع لأغراض سياسية.</li>
      </ul>
      <p>
        إن أي انتهاك لبنود قائمة المحظورات المذكورة أعلاه تخول منصة طور نفسك إنهاء استخدامك ووصولك و/أو مشاركتك في الموقع دون إشعار مسبق.
      </p>
      <h2>حقوقك المتعلقة ببياناتك</h2>
      <p>
        يمكنك طلب الحصول على ملف يتم تصديره من البيانات الشخصية التي نحتفظ بها عنك، بما في ذلك أي بيانات قدمتها لنا. يمكنك أيضًا طلب حذف أي بيانات شخصية نحتفظ بها عنك، يُستثنى من ذلك البيانات الملزمون بالحفاظ عليها لأغراض إدارية أو قانونية أو أمنية من قبل الجهات التنظيمية.
      </p>
    </div>
  );
};

export default PrivacyPolicy;
