import React from 'react';

const TermsOfService = () => {
    return (
        <div style={{ margin: '20px auto', padding: '20px', maxWidth: '800px', backgroundColor: '#fff', borderRadius: '8px', boxShadow: '0 0 10px rgba(0,0,0,0.1)' }}>
            <h1 style={{ color: '#0000ffc5', textAlign: 'center' }}>شروط الخدمة</h1>

            <section>
                <h2 style={{ color: '#444' }}>المقدمة</h2>
                <p>
                    يُرجى قراءة شروط الخدمة وسياسة الخصوصية بعناية قبل التسجيل في الموقع أو استخدام أي من الخدمات المتاحة على المنصة. تعتبر هذه الشروط وسياسة الخصوصية اتفاقية بينك وبين منصة "تطوير نفسك". باستخدامك للمنصة، فإنك تقبل وتوافق على الالتزام القانوني بهذه الاتفاقيات سواء كنت مستخدمًا مسجلاً أم لا. تحتفظ المنصة بالحق في تعديل هذه الشروط في أي وقت دون إشعار مسبق. تصبح التعديلات سارية فور نشرها على هذه الصفحة أو أي قسم آخر في الموقع. استمرارك في الوصول إلى المنصة بعد أي تغييرات يعني قبولك للشروط المعدلة.
                </p>
            </section>

            <section>
                <h2 style={{ color: '#444' }}>الحسابات</h2>
                <ul>
                    <li>يجب أن تكون أسماء المستخدمين ذات معاني واضحة ولا تتكون من رموز أو أرقام فقط. يُمنع استخدام أي أسماء تحرض على الكراهية أو العنف أو استخدام علامات تجارية كاسم مستخدم.</li>
                    <li>المستخدم مسؤول عن دقة المعلومات التي يضيفها إلى حسابه ويتحمل المسؤولية الكاملة عن أي معلومات غير صحيحة يقدمها.</li>
                    <li>يُمنع على المستخدم إنشاء أكثر من حساب واحد على منصة "تطوير نفسك". في حال واجه المستخدم مشكلة مع حسابه الأول، يجب عليه التواصل معنا لحل المشكلة.</li>
                    <li>يجب على المستخدم تحميل صورته الشخصية الحقيقية وعدم استخدام صور أشخاص آخرين أو صور ترويجية في ملفه الشخصي.</li>
                </ul>
            </section>

            <section>
                <h2 style={{ color: '#444' }}>حماية المستخدم</h2>
                <ul>
                    <li>في حالة تعليق الحساب بسبب اشتباه في اختراقه أو بناءً على تقدير إدارة المنصة، يحق للمنصة طلب وثائق ومعلومات شخصية للتحقق من هوية المستخدم.</li>
                    <li>الأساتذة والمحاضرون والخبراء والمتخصصون في مجال التدريب والتعليم يحتفظون بكامل حقوق الملكية الفكرية وحقوق الطبع والنشر للمحتوى الذي ينشرونه على المنصة.</li>
                    <li>المنصة تحترم جميع القوانين المتعلقة بحقوق الطبع والنشر والخصوصية والقوانين الأخرى ذات الصلة.</li>
                    <li>إذا كنت تعتقد أن المحتوى المعروض ينتهك خصوصيتك أو أي قانون، فإن من واجبك الإبلاغ عن ذلك لنا لتصحيح الوضع.</li>
                </ul>
            </section>

            <section>
                <h2 style={{ color: '#444' }}>حقوق التسجيل والمحتوى</h2>
                <ul>
                    <li>كمحاضر أو أستاذ، توافق على أن المنصة قد تسجل كل أو جزء من الدورات أو المحاضرات.</li>
                    <li>المنصة مسؤولة عن ضمان توفير فرص التدريب في المؤسسات المعلن عنها أو المتعاقد معها.</li>
                    <li>تتوفر عروض العمل على المنصة مع مسؤولية الإبلاغ عن أي معلومات خاطئة.</li>
                </ul>
            </section>
            <section>
                <h2 style={{ color: '#444' }}>التنبيهات وإيقاف الحسابات</h2>
                <ul>
                    <li>قد يتم إرسال تنبيهات للمستخدمين بسبب انتهاك الشروط أو الاستخدام غير المناسب للمنصة.
                    قد يؤدي انتهاك الشروط إلى إيقاف الحساب بشكل دائم.</li>
                </ul>
            </section>

            <section>
                <h2 style={{ color: '#444' }}>الدفع والاشتراكات  </h2>
                <ul>
                    <li>
                    يلتزم المستخدم بدفع رسوم الاشتراك أو الخدمات المقدمة حسب طرق الدفع المحددة.
يُمنع استخدام وسائل غير قانونية في الدفع، وسيؤدي ذلك إلى الحظر والمساءلة القانونية.
تُجدد الاشتراكات تلقائيًا وفقًا للشروط المتفق عليها، ويمكن للمستخدم إلغاء الاشتراك وفقًا للسياسات المحددة.
                    </li>
                </ul>
            </section>


            <section>
                <h2 style={{ color: '#444' }}>  حقوق الملكية الفكرية</h2>
                <ul>
                    <li>
                    تُعتبر العلامات التجارية والشعارات المستخدمة في المنصة مملوكة للمنصة أو المؤسسات المشاركة.
                    يُمنع استخدام أي من هذه العلامات التجارية دون موافقة خطية مسبقة.
                    </li>
                </ul>
            </section>


            <section>
                <h2 style={{ color: '#444' }}> الشهادات </h2>
                <ul>
                    <li>
                    تسعى المنصة إلى توفير شهادات إتمام الدورات التدريبية وتحسين المستوى الدراسي للموظفين والمستخدمين الذين يستوفون الشروط المطلوبة.
                    تُمنح شهادات التكوين للمتدربين بناءً على نجاحهم في التكوين الميداني أو الدورات التدريبية المتاحة.
                    </li>
                </ul>
            </section>
            <section>
                <h2 style={{ color: '#444' }}> حل النزاعات والدعم الفني </h2>
                <ul>
                    <li>
                    تقدم المنصة الدعم الفني للمستخدمين الذين يواجهون مشاكل في الوصول إلى المحتويات التعليمية.
                    يتم توجيه الطلاب لحل مشاكلهم بالتواصل مع المحاضرين، وفي حال عدم الاستجابة، يحق للمنصة اتخاذ الإجراءات المناسبة.  
                    </li>
                </ul>
            </section>

            <section>
                <h2 style={{ color: '#444' }}> التواصل والمراسلات </h2>
                <ul>
                    <li>
                    يحق للمنصة إرسال رسائل بريدية إلكترونية للمستخدمين حول تحديثات الخدمات. يمكن للمستخدمين إلغاء الاشتراك في هذه الرسائل باستثناء الرسائل المهمة المتعلقة بالخدمات المشترك بها. 
                    </li>
                </ul>
            </section>


        </div>
    );
};

export default TermsOfService;
